package hw;

public class Practice1_ExceptionPurpose {

    public static void main(String[] args) {

        // Error — серьезные проблемы JVM, не предназначены для обработки
        // Пример: нехватка памяти

        // Exception — ошибки, которые можно обработать и продолжить работу
        // Пример: ошибка ввода данных пользователем

        // RuntimeException — ошибки программиста
        // Пример: деление на ноль, выход за границы массива

        System.out.println("Назначение основных классов исключений разобрано");
    }
}
